---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AtomViolationWhenOnePlaceInstance
source: html/8c04e8dd-57da-0e4a-981c-907d48a2e79f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AtomViolationWhenOnePlaceInstance Property

A group has been changed outside group edit mode. The change is being allowed because there is only one instance of the type.

## Syntax (C#)
```csharp
public static FailureDefinitionId AtomViolationWhenOnePlaceInstance { get; }
```